public class Main {
    public static void main(String[] args) {
        Human maxim = new Human("Максим", "Минск", 1988, "бренд-менеджер");
        Human anna = new Human("Аня", "Москва", 1993, "методист образовательных программ");
        Human kate = new Human("Катя", "Калининград", -1992, "продукт-менеджер");
        Human artem = new Human("Артем", "", -1, "директор по развитию бизнеса");
        Human vladimir = new Human("Владимир", "Казань", 2001, "сейчас ни где не работаю");

        maxim.info();
        anna.info();
        kate.info();
        artem.info();
        vladimir.info();


        /*System.out.println("--------------------------------------------------------------------------------------------------------------------------------------------------------------");
        System.out.println("Привет! Меня зовут " + maxim.getName() + ". Я из города " + maxim.getTown() + ". Я родился(-ась) в " + maxim.getYearOfBirth() + ". Я работаю на должности: " + maxim.getJobTitle() + ". Будем знакомы!");
        System.out.println("--------------------------------------------------------------------------------------------------------------------------------------------------------------");
        System.out.println("Привет! Меня зовут " + anna.getName() + ". Я из города " + anna.getTown() + ". Я родился(-ась) в " + anna.getYearOfBirth() + ". Я работаю на должности: " + anna.getJobTitle() + ". Будем знакомы!");
        System.out.println("--------------------------------------------------------------------------------------------------------------------------------------------------------------");
        System.out.println("Привет! Меня зовут " + kate.getName() + ". Я из города " + kate.getTown() + ". Я родился(-ась) в " + kate.getYearOfBirth() + ". Я работаю на должности: " + kate.getJobTitle() + ". Будем знакомы!");
        System.out.println("--------------------------------------------------------------------------------------------------------------------------------------------------------------");
        System.out.println("Привет! Меня зовут " + artem.getName() + ". Я из города " + artem.getTown() + ". Я родился(-ась) в " + artem.getYearOfBirth() + ". Я работаю на должности: " + artem.getJobTitle() + ". Будем знакомы!");
        System.out.println("--------------------------------------------------------------------------------------------------------------------------------------------------------------");*/
    }
}

